# PART 1

In [1]:
import os
import numpy as np
import pandas as pd
from sqlalchemy import create_engine

In [2]:
os.listdir("Data/")

['basics.csv',
 'ratings.csv',
 'title-akas-us-only.csv',
 'title.basics.tsv.gz',
 'title.ratings.tsv.gz']

In [3]:
akas_url = "C:/Users/dsdye/Documents/GitHub/prediction-of-movie-success/Data/title-akas-us-only.csv"

basics_url = "C:/Users/dsdye/Documents/GitHub/prediction-of-movie-success/Data/title.basics.tsv.gz"
ratings_url = "C:/Users/dsdye/Documents/GitHub/prediction-of-movie-success/Data/title.ratings.tsv.gz"

akas = pd.read_csv(akas_url, low_memory=False)
basics = pd.read_csv(basics_url, sep="\t", low_memory=False)
ratings = pd.read_csv(ratings_url, sep="\t", low_memory=False)

### Preprocessing Title Basics

In [ ]:
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,\N,imdbDisplay,\N,0
1,tt0000002,7,The Clown and His Dogs,US,\N,\N,literal English title,0
2,tt0000005,10,Blacksmith Scene,US,\N,imdbDisplay,\N,0
3,tt0000005,1,Blacksmithing Scene,US,\N,alternative,\N,0
4,tt0000005,6,Blacksmith Scene #1,US,\N,alternative,\N,0

In [ ]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [ ]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1988
1  tt0000002            5.8       265
2  tt0000003            6.5      1849
3  tt0000004            5.5       178
4  tt0000005            6.2      2632

In [ ]:
# Filter the basics table down to only include the US by using the filter akas dataframe
filter_us_titles = basics['tconst'].isin(akas['titleId'])  
basics = basics[filter_us_titles]
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"
5,tt0000006,short,Chinese Opium Den,Chinese Opium Den,0,1894,\N,1,Short
6,tt0000007,short,Corbett and Courtney Before the Kinetograph,Corbett and Courtney Before the Kinetograph,0,1894,\N,1,"Short,Sport"
...,...,...,...,...,...,...,...,...,...
10016872,tt9916560,tvMovie,March of Dimes Presents: Once Upon a Dime,March of Dimes Presents: Once Upon a Dime,0,1963,\N,58,Family
10016901,tt9916620,movie,The Copeland Case,The Copeland Case,0,\N,\N,\N,Drama
10016939,tt9916702,short,Loving London: The Playground,Loving London: The Playground,0,\N,\N,\N,"Drama,Short"
10016962,tt9916756,short,Pretty Pretty Black Girl,Pretty Pretty Black Girl,0,2019,\N,\N,Short
10016966,tt9916764,short,38,38,0,2018,\N,\N,Short

In [ ]:
filter_basics = ratings['tconst'].isin(basics['tconst'])

# basics.head()
basics.value_counts()
filter_basics.value_counts()

False    827492
True     504000
Name: tconst, dtype: int64

In [ ]:
# Filter the basics table down to only include the US by using the filter akas dataframe
# filter_ratings = ratings['tconst'].isin(basics['tconst'])
# basics = basics[filter_ratings]
# basics

akas = akas.replace({'\\N':np.nan})
basics = basics.replace({'\\N':np.nan})

# akas.head()
basics.head()

### Keep Only US Movies

filter_us_titles = basics['tconst'].isin(akas['titleId'])
basics = basics[filter_us_titles]
basics

### Keep Only Full-Length Movies

basics = basics[basics['titleType'] == 'movie']
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 299550 entries, 8 to 10016901
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          299550 non-null  object
 1   titleType       299550 non-null  object
 2   primaryTitle    299550 non-null  object
 3   originalTitle   299550 non-null  object
 4   isAdult         299550 non-null  object
 5   startYear       240304 non-null  object
 6   endYear         0 non-null       object
 7   runtimeMinutes  207381 non-null  object
 8   genres          288855 non-null  object
dtypes: object(9)
memory usage: 22.9+ MB

### Start Year

#### Convert startYear to a float dtype

In [ ]:
basics.startYear.describe()

#### Filter to keep movies with startYears that are >=2000 and <=2022

count     240304
unique       135
top         2019
freq        9620
Name: startYear, dtype: object

In [ ]:
basics['startYear'] = basics['startYear'].astype(float)

In [ ]:
basics = basics[(basics['startYear'] >= 2000)]
basics = basics[(basics['startYear'] <= 2022)]

### Eliminate movies that include "Documentary" in genre

In [ ]:
basics = basics[~basics['genres'].str.contains('Documentary', na=False)]

### Summary

In [ ]:
[print(col, basics[col].info(), '\n\n') for col in basics.columns]

NameError: name 'basics' is not defined

In [ ]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
93930,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

# Part 2

In [ ]:
# Create the sqlalchemy engine and connection
username = "root"
password = "root"
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [ ]:
basics['runtimeMinutes'].filter(regex='[a-zA-Z]').value_counts()

Series([], Name: runtimeMinutes, dtype: int64)

In [ ]:
basics['runtimeMinutes'].info()

<class 'pandas.core.series.Series'>
Int64Index: 104636 entries, 34802 to 10016809
Series name: runtimeMinutes
Non-Null Count  Dtype
--------------  -----
88546 non-null  object
dtypes: object(1)
memory usage: 1.6+ MB

In [ ]:
basics['runtimeMinutes'] = pd.to_numeric(basics['runtimeMinutes'], errors='raise', downcast='integer')

In [ ]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 104636 entries, 34802 to 10016809
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          104636 non-null  object
 1   titleType       104636 non-null  object
 2   primaryTitle    104636 non-null  object
 3   originalTitle   104636 non-null  object
 4   isAdult         104636 non-null  object
 5   startYear       104636 non-null  float64
 6   endYear         0 non-null       object
 7   runtimeMinutes  88546 non-null   float64
 8   genres          101501 non-null  object
dtypes: float64(2), object(7)
memory usage: 8.0+ MB

In [ ]:
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres
4        tmdb_data

In [ ]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 104636 entries, 34802 to 10016809
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          104636 non-null  object
 1   titleType       104636 non-null  object
 2   primaryTitle    104636 non-null  object
 3   originalTitle   104636 non-null  object
 4   isAdult         104636 non-null  object
 5   startYear       104636 non-null  float64
 6   endYear         0 non-null       object
 7   runtimeMinutes  88546 non-null   float64
 8   genres          101501 non-null  object
dtypes: float64(2), object(7)
memory usage: 8.0+ MB

In [ ]:
q = ''' DESCRIBE title_basics'''
pd.read_sql(q, conn)

           Field      Type Null Key Default Extra
0         tconst      text  YES        None
1  primary_title      text  YES        None
2     start_year  smallint  YES        None
3        runtime    double  YES        None

## Start Year

In [ ]:
basics['startYear'].unique()

array([2001., 2020., 2018., 2005., 2002., 2017., 2006., 2004., 2000.,
       2009., 2003., 2008., 2007., 2022., 2011., 2019., 2021., 2010.,
       2012., 2013., 2015., 2016., 2014.])

In [ ]:
basics['startYear'] = basics['startYear'].replace('\\N', '0')

In [ ]:
basics['startYear'] = pd.to_numeric(basics['startYear'], errors='raise', downcast='integer')

In [ ]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 104636 entries, 34802 to 10016809
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          104636 non-null  object
 1   titleType       104636 non-null  object
 2   primaryTitle    104636 non-null  object
 3   originalTitle   104636 non-null  object
 4   isAdult         104636 non-null  object
 5   startYear       104636 non-null  int16
 6   endYear         0 non-null       object
 7   runtimeMinutes  88546 non-null   float64
 8   genres          101501 non-null  object
dtypes: float64(1), int16(1), object(7)
memory usage: 7.4+ MB

In [ ]:
basics['startYear']

34802       2001
61114       2020
67666       2018
86793       2005
93930       2002
            ...
10016544    2019
10016684    2019
10016693    2020
10016777    2020
10016809    2019
Name: startYear, Length: 104636, dtype: int16

In [ ]:
# basics = basics.rename(columns = {'startYear': 'start_year'}, errors='raise')

## Runtime

In [ ]:

# pd.to_datetime(basics['startYear'], format='%Y', errors='error')
basics['runtimeMinutes'].astype('str').str.len().max()

6

In [ ]:
basics['runtimeMinutes'].describe()

count    88546.000000
mean        94.866137
std         36.855305
min          2.000000
25%         83.000000
50%         92.000000
75%        105.000000
max       7200.000000
Name: runtimeMinutes, dtype: float64

In [ ]:
basics['runtimeMinutes'] = basics['runtimeMinutes'].replace('\\N', 0)
# basics['runtimeMinutes'] = pd.to_numeric(basics['runtimeMinutes'], errors='raise', downcast='integer')

In [ ]:
basics = basics.rename(columns = {'runtimeMinutes': 'runtime'}, errors='raise')

In [ ]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 104636 entries, 34802 to 10016809
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         104636 non-null  object
 1   titleType      104636 non-null  object
 2   primaryTitle   104636 non-null  object
 3   originalTitle  104636 non-null  object
 4   isAdult        104636 non-null  object
 5   startYear      104636 non-null  int16
 6   endYear        0 non-null       object
 7   runtime        88546 non-null   float64
 8   genres         101501 non-null  object
dtypes: float64(1), int16(1), object(7)
memory usage: 7.4+ MB

## Primary Title

## Genres

In [ ]:
q = ''' DESCRIBE genres'''
describe_genres = pd.read_sql(q, conn)
describe_genres

        Field    Type Null  Key Default Extra
0       index  bigint  YES  MUL    None
1  Genre_Name    text  YES         None
2    Genre_ID  bigint  YES         None

In [ ]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 104636 entries, 34802 to 10016809
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         104636 non-null  object
 1   titleType      104636 non-null  object
 2   primaryTitle   104636 non-null  object
 3   originalTitle  104636 non-null  object
 4   isAdult        104636 non-null  object
 5   startYear      104636 non-null  int16
 6   endYear        0 non-null       object
 7   runtime        88546 non-null   float64
 8   genres         101501 non-null  object
dtypes: float64(1), int16(1), object(7)
memory usage: 7.4+ MB

In [ ]:
basics.genres

34802          Comedy,Fantasy,Romance
61114                           Drama
67666                           Drama
86793            Comedy,Horror,Sci-Fi
93930                           Drama
                      ...
10016544         Comedy,Drama,Fantasy
10016684                        Drama
10016693    Action,Adventure,Thriller
10016777                Drama,History
10016809        Adventure,History,War
Name: genres, Length: 104636, dtype: object

In [ ]:
basics['primaryTitle']

34802                                          Kate & Leopold
61114       The Tango of the Widower and Its Distorting Mi...
67666                              The Other Side of the Wind
86793                                       The Naked Monster
93930                                    Crime and Punishment
                                  ...
10016544                                 The Last White Witch
10016684                                        The Rehearsal
10016693                                            Safeguard
10016777                                                Coven
10016809                                  The Secret of China
Name: primaryTitle, Length: 104636, dtype: object

In [ ]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtime,genres
34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118.0,"Comedy,Fantasy,Romance"
61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70.0,Drama
67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122.0,Drama
86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100.0,"Comedy,Horror,Sci-Fi"
93930,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126.0,Drama

In [ ]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 104636 entries, 34802 to 10016809
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         104636 non-null  object
 1   titleType      104636 non-null  object
 2   primaryTitle   104636 non-null  object
 3   originalTitle  104636 non-null  object
 4   isAdult        104636 non-null  object
 5   startYear      104636 non-null  int16
 6   endYear        0 non-null       object
 7   runtime        88546 non-null   float64
 8   genres         101501 non-null  object
dtypes: float64(1), int16(1), object(7)
memory usage: 7.4+ MB

In [ ]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1988
1  tt0000002            5.8       265
2  tt0000003            6.5      1849
3  tt0000004            5.5       178
4  tt0000005            6.2      2632

In [ ]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1331492 entries, 0 to 1331491
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1331492 non-null  object
 1   averageRating  1331492 non-null  float64
 2   numVotes       1331492 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 30.5+ MB

In [ ]:
ratings.to_csv('Data/ratings.csv', index=False)

In [ ]:
basics.to_csv('Data/basics.csv', index=False)